//----------------------------------------------------------------------------
// Divider_MainWnd.cpp : 区切り線その１の管理を行う
//----------------------------------------------------------------------------
#include <windows.h>
#include "../App.h"
#include "MainWnd.h"
#include "Divider_MainWnd.h"
//----------------------------------------------------------------------------
// 作成
//----------------------------------------------------------------------------
BOOL CDivider_MainWnd::Create()
{
	CStatic::Create(SS_SUNKEN);
	if(!m_hWnd) return FALSE;
	SetParent(m_rMainWnd);
	SetPos(0, 0);
	SetSize(0, 2);
	Show(SW_SHOW);

	return TRUE;
}
//----------------------------------------------------------------------------
// サイズを再設定
//----------------------------------------------------------------------------
void CDivider_MainWnd::ResetSize()
{
	SetSize(m_rMainWnd.GetClientWidth(), 2);
}
//----------------------------------------------------------------------------
