//----------------------------------------------------------------------------
// Menu.cpp : メニューの作成・管理・破棄を行う
//----------------------------------------------------------------------------
#include <windows.h>
#include "Menu.h"
//----------------------------------------------------------------------------
// メニューの末尾に新しい項目を追加
//----------------------------------------------------------------------------
BOOL CMenu::Append(UINT uFlags, UINT_PTR uIDNewItem = 0,
					LPCTSTR lpNewItem = NULL)
{
	// uFlags		: 設定フラグ
	// uIDNewItem	: コマンド ID または HMENU
	// lpNewItem	: メニュー項目の内容

	return AppendMenu(m_hMenu, uFlags, uIDNewItem, lpNewItem);
}
//----------------------------------------------------------------------------
// メニューの末尾に区切り線を追加
//----------------------------------------------------------------------------
BOOL CMenu::AppendSeparator()
{
	return AppendMenu(m_hMenu, MF_SEPARATOR, 0, NULL);
}
//----------------------------------------------------------------------------
// 作成
//----------------------------------------------------------------------------
BOOL CMenu::Create()
{
	Destroy();
	m_hMenu = CreateMenu();
	if(!m_hMenu) return FALSE;
	return TRUE;
}
//----------------------------------------------------------------------------
// ポップアップメニューの作成
//----------------------------------------------------------------------------
BOOL CMenu::CreatePopup()
{
	Destroy();
	m_hMenu = CreatePopupMenu();
	if(!m_hMenu) return FALSE;
	return TRUE;
}
//----------------------------------------------------------------------------
// 破壊
//----------------------------------------------------------------------------
void CMenu::Destroy()
{
	if(m_hMenu) DestroyMenu(m_hMenu), m_hMenu = 0;
}
//----------------------------------------------------------------------------
// メニューに新しい項目を挿入
//----------------------------------------------------------------------------
BOOL CMenu::Insert(UINT uPosition, UINT uFlags, UINT_PTR uIDNewItem = 0,
					LPCTSTR lpNewItem = NULL)
{
	return InsertMenu(m_hMenu, uPosition, uFlags, uIDNewItem, lpNewItem);
}
//----------------------------------------------------------------------------
