//----------------------------------------------------------------------------
// Tab.h : タブコントロールの作成・管理を行う
//----------------------------------------------------------------------------
#ifndef TabH
#define TabH

#include <QTabWidget>
//----------------------------------------------------------------------------
// タブコントロールの作成・管理を行うクラス
//----------------------------------------------------------------------------
class CTab : public QTabWidget
{
public: // 関数

	explicit CTab(QWidget * parent = nullptr) : QTabWidget(parent) { }
	virtual ~CTab() { }

	virtual int GetCurrentFocus() {
		return currentIndex();
	}
};
//----------------------------------------------------------------------------

#endif
